maksyuki/breeze_firmware_demo/keil/Modules/Module_nRF51822/User/main.c
static ble_nus_t                        m_nus;                                      /**< Structure to identify the Nordic UART Service. */
static uint16_t                         m_conn_handle = BLE_CONN_HANDLE_INVALID;    /**< Handle of the current connection. */

static ble_uuid_t                       m_adv_uuids[] = {{BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}};  /**< Universally unique service identifier. */


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}

//user code==========================================
//===================================================
static void nrf_delay_ms(uint32_t volatile number_of_ms)
{
    int i;
	   while(number_of_ms != 0)
    {
        number_of_ms--;
        while(i<1000)
				{
          ++i;
        }
        i=0;
    }
}


// Power managment pins

#define PM_GPIO_SYSOFF          30
#define PM_GPIO_EN1             24
#define PM_GPIO_EN2             25
#define PM_GPIO_IN_CHG          22
#define PM_GPIO_IN_PGOOD        23

APP_TIMER_DEF(LED1_toggle_timer_id);
#define CHARGED_LED_OFF_INTERVAL 1800
#define CHARGED_LED_ON_INTERVAL  200

typedef enum
{
    charge100mA,
    charge500mA,
    chargeMax,
} BatteryChargeMode;

typedef enum
{
    battery,
    charging,
    charged,
    lowPower,
    shutDown,
} BatteryChargeStates;

static void battery_managment_init(void)
{
    // Configure PM PGOOD pin (Power good)
    NRF_GPIO->PIN_CNF[PM_GPIO_IN_PGOOD] = 0;     // 输入，不上下拉，标准驱动0、1
    // Configure PM CHG pin (Charge)
    NRF_GPIO->PIN_CNF[PM_GPIO_IN_CHG]   = 3<<2;  // 输入，上拉，标准驱动0、1
    // Configure PM EN2 pin
    NRF_GPIO->PIN_CNF[PM_GPIO_EN2]      = 0x301; // 输出，高驱动0，高驱动1，不上下拉
	// Configure PM EN1 pin
    NRF_GPIO->PIN_CNF[PM_GPIO_EN1]      = 0x301; // 输出，高驱动0，高驱动1，不上下拉
    // Configure PM SYSOFF pin
    NRF_GPIO->PIN_CNF[PM_GPIO_SYSOFF]   = 0x301; // 输出，高驱动0，高驱动1，不上下拉
}

static void battery_setChargeMode(BatteryChargeMode chgMode)
{
    switch (chgMode)
    {
        case charge100mA:
            nrf_gpio_pin_clear(PM_GPIO_EN1);
            nrf_gpio_pin_clear(PM_GPIO_EN2);
            break;
        case charge500mA:
            nrf_gpio_pin_set(PM_GPIO_EN1);
            nrf_gpio_pin_clear(PM_GPIO_EN2);
            break;
        case chargeMax:
            nrf_gpio_pin_clear(PM_GPIO_EN1);
            nrf_gpio_pin_set(PM_GPIO_EN2);
            break;
    }
}

static BatteryChargeStates Battery_updateChargeState(void)
{
    uint32_t next_delay = 0;
    BatteryChargeStates m_battery_chargestate;
    bool isCharging = !nrf_gpio_pin_read(PM_GPIO_IN_CHG);
    bool isPgood    = !nrf_gpio_pin_read(PM_GPIO_IN_PGOOD);

    if (isPgood && !isCharging) //充电完成
    {
        m_battery_chargestate = charged;
        bool pin_set = nrf_gpio_pin_out_read(18) ? true: false;

        if (pin_set)
        {
            nrf_gpio_pin_clear(18);
            next_delay = CHARGED_LED_OFF_INTERVAL;
        }
        else
        {
            nrf_gpio_pin_set(18);
            next_delay = CHARGED_LED_ON_INTERVAL;
        }
        app_timer_start(LED1_toggle_timer_id, APP_TIMER_TICKS(next_delay, APP_TIMER_PRESCALER), NULL);
    }
    else if (isPgood && isCharging) //正在充电
    {
        m_battery_chargestate = charging;
        nrf_gpio_pin_set(18); 
    }
    else if (!isPgood && !isCharging) //没插USB充电线
    {
        m_battery_chargestate = lowPower;
        nrf_gpio_pin_clear(18); 
    }
    else
    {
        m_battery_chargestate = battery;
        nrf_gpio_pin_clear(18);
    }
    return m_battery_chargestate;
}

static void battery_poweroff(void)
{
    nrf_gpio_pin_clear(PM_GPIO_SYSOFF);
    nrf_delay_ms(100);
    nrf_gpio_pin_set(PM_GPIO_SYSOFF);
    nrf_delay_ms(100);
    nrf_gpio_pin_clear(PM_GPIO_SYSOFF);
}

static void battery_timer_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    Battery_updateChargeState();
}

#define CHARGESTATE_SAMPLE_RATE 1000 //1000ms

static const nrf_drv_timer_t m_timer_battery = NRF_DRV_TIMER_INSTANCE(1);

static void battery_timeout_handler(nrf_timer_event_t event_type, void* p_context)
{
    UNUSED_PARAMETER(p_context);
    Battery_updateChargeState();
}
    
static void timer1_init(void)
{
    ret_code_t err_code;
    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    err_code = nrf_drv_timer_init(&m_timer_battery, &timer_cfg, battery_timeout_handler);

    APP_ERROR_CHECK(err_code);
    uint32_t time_ticks = nrf_drv_timer_ms_to_ticks(&m_timer_battery, CHARGESTATE_SAMPLE_RATE);
    nrf_drv_timer_extended_compare(&m_timer_battery, NRF_TIMER_CC_CHANNEL0,
    time_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);
    nrf_drv_timer_enable(&m_timer_battery);
}




#define ADC_BUFFER_SIZE 1
#define ADC_SAMPLE_RATE 1000 // 1000ms

static nrf_adc_value_t adc_buffer[ADC_BUFFER_SIZE];

